app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Smiths"], ["updated_at", "2021-01-02 15:13:15.058014"], ["id", 3]]
---
    def update
        @student = Student.find(params[:id])
        @student.update(post_params(:first_name, :last_name))